app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "綺麗"], ["created_at", "2021-10-13 11:34:03.598352"], ["updated_at", "2021-10-13 11:34:03.598352"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save