app/controllers/admin/homes_controller.rb

  def top #管理者トップページ(注文履歴一覧)
    @orders = Order.all
---
SELECT "orders".* FROM "orders"