app/controllers/admin/items_controller.rb

  def new
    @item = Item.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "うんぴ"], ["introduction", "小学生が大好きなものです。"], ["price", 10000], ["is_active", 1], ["created_at", "2021-10-13 11:34:39.173830"], ["updated_at", "2021-10-13 11:34:39.173830"]]

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "is_active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["is_active", 1], ["updated_at", "2021-10-08 12:10:06.446267"], ["id", 1]]