app/controllers/public/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index #配送先登録/一覧画面
   @address = Address.new
   @addresses = Address.all

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "具志堅"], ["postal_code", "5769993"], ["address", "沖縄県那覇市"], ["created_at", "2021-10-13 12:02:12.700206"], ["updated_at", "2021-10-13 12:02:12.700206"]]
SELECT "addresses".* FROM "addresses"
---
  def create #配送先の登録
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save
      flash[:notice] = "配送先を新たに登録しました"
    　redirect_to addresses_path
    else
      render :index
      @addresses = Address.all