app/controllers/public/customers_controller.rb

  def update
    @customer = current_customer
    if @customer.update(customer_params)
---
UPDATE "customers" SET "last_name" = ?, "last_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "aho"], ["last_name_kana", "アホ"], ["updated_at", "2021-10-08 12:52:30.115348"], ["id", 3]]

  def withdraw
    @customer = current_customer
    current_customer.update(is_active: true)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2021-10-08 13:01:45.741762"], ["id", 3]]