app/controllers/public/orders_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def confirm #注文情報確認画面
    @order = Order.new(order_params)
    render :new if @order.invalid?
    binding.pry
    @address = Address.find(params[:order][:address_id])

SELECT "orders".* FROM "orders"
---
  def index #注文履歴画面
    @orders = Order.all