app/views/public/orders/index.html.erb

              <td>
               <% order.order_details.each do |order_detail| %>
---
SELECT "orders".* FROM "orders"