app/views/public/orders/new.html.erb

          <%= f.label :address,"登録済住所から選択" %><br>
          <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :name) %>
---
SELECT "addresses".* FROM "addresses"